## 문제1

In [ ]:
# 타이타닉 데이터를 불러와서 pclass등급이 3 이고 
#나이가 30이상인 남성의 생존율을 구하라.

In [ ]:
총승선인원 891명, 생존인원9명 -> 생존율 1%

In [3]:
import seaborn as sns

In [4]:
titanic = sns.load_dataset('titanic')

In [74]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [71]:
titanic.shape

(891, 15)

In [84]:
#loc활용 검색가능
titanic_surv = titanic.loc[((titanic['pclass']==3) & 
              (titanic['sex']=='male') &
              (titanic['alive']=='yes')&
              (titanic['age'] > 30)),
             ['class', 'who','alive','age']]

In [85]:
titanic_surv.shape

(9, 4)

In [78]:
titanic_surv.head()

     class  who alive   age
74   Third  man   yes  32.0
338  Third  man   yes  45.0
400  Third  man   yes  39.0
414  Third  man   yes  44.0
429  Third  man   yes  32.0

In [79]:
titanic_surv.loc[:,['class', 'who','alive','age']]

     class  who alive   age
74   Third  man   yes  32.0
338  Third  man   yes  45.0
400  Third  man   yes  39.0
414  Third  man   yes  44.0
429  Third  man   yes  32.0
569  Third  man   yes  32.0
579  Third  man   yes  32.0
744  Third  man   yes  31.0
838  Third  man   yes  32.0

## 문제2

In [181]:
# Worldwide Gross를 원화를 환산하여 필드를 추가하여라(원화는 $당 1300원)

In [182]:
movies= pd.read_csv("data/movies.csv",usecols = ['Film','Genre','Year','Worldwide Gross'])

In [183]:
movies.head()

                                 Film    Genre Worldwide Gross  Year
0          Zack and Miri Make a Porno  Romance         $41.94   2008
1                     Youth in Revolt   Comedy         $19.62   2010
2  You Will Meet a Tall Dark Stranger   Comedy         $26.66   2010
3                        When in Rome   Comedy         $43.04   2010
4               What Happens in Vegas   Comedy        $219.37   2008

In [184]:
movies_add  = pd.read_csv("data/movies.csv")

In [185]:
movies_add.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008

In [186]:
movies_add['has_seen'] = 0

In [187]:
movies_add.columns

Index(['Film', 'Genre', 'Lead Studio', 'Audience score %', 'Profitability',
       'Rotten Tomatoes %', 'Worldwide Gross', 'Year', 'has_seen'],
      dtype='object')

In [188]:
movies_add['has_seen'] = (movies_add['Audience score %'] + movies_add['Rotten Tomatoes %'])// 2

In [189]:
d=movies_add['Worldwide Gross'].str.replace('$','', regex=False).astype('float64')

In [190]:
d

0      41.94
1      19.62
2      26.66
3      43.04
4     219.37
       ...
72     29.37
73     30.68
74      8.97
75    160.31
76     60.72
Name: Worldwide Gross, Length: 77, dtype: float64

In [191]:
movies_add.insert(movies_add.columns.get_loc('has_seen')+1, "원화환산", d * 1300)

In [192]:
movies_add.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year,has_seen,원화환산
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008,67,54522.0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010,60,25506.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010,39,34658.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010,29,55952.0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008,50,285181.0